{
  "tags": ["Research", "Design", "Front-end Development"],
  "date": "2020-05-03T10:29:26.091Z",
  "title": "Student Hut",
  "description": "Trip Advisor for universities. Student Hut is a website aimed at current, previous and potential students. Students can view reviews and rate all parts of life at uni. ",
  "feature_image": "/uploads/studenthut-uni.png",
  "banner_images": ["/uploads/studenthut-uni-banner.png"],
  "project_link": "https://studenthut.com",
  "project_link_text": "View Website",
  "sections": [
    {
      "type": "content",
      "body": "## What is it\n\nStudent Hut is a hub for students to review Universities, Cities, Nightlife and Accomodation. It allows current and graduated students to leave reviews on their University, or City for other potential students to read which helps them make the right decision.\n\nDue to the pandemic, the focus has shifted more toward a mental health hub for students, and research provider for Universities to help make the best decisions for their students.\n\n A Student panel was introduced, where students can collect points in exchange for completing surveys, which in turn they can gain Amazon vouchers."
    },
    {
      "type": "image",
      "image": "/uploads/studenthut-home.jpg",
      "caption": "Home page"
    },
    {
      "type": "content",
      "body": "## My role\n\nTasked with redesigning and rebuilding the front-end was quite a nice job, due to having maintained this site in the past. The old site was built with drupal and by 5 different development companies, so the front-end was a bit of a state, each page had its own CSS file with IDs for absolutely everything, and nested as much as you can go, making it virtually impossible to maintain.\n\nWe avoided using a framework purposefully for this site, as it wouldve been a bit overkill. The front-end is straight up HTML, CSS and Javascript, which meant page speeds were nice and quick, scoring very highly on Google Page Speed. Recently, however, this has dropped due to an influx of advertisments / tracking scripts being placed on the site for revenue."
    },
    {
      "type": "dual_images",
      "image": "/uploads/studenthut-old.jpg",
      "image_2": "/uploads/studenthut-new.jpg",
      "caption": "Old Home",
      "caption_2": "New Home"
    },
    {
      "type": "content",
      "body": "## What I've learnt\n\nNot everything needs to be built with a javascript framework! This quite large site didn't need a large framework even though it was discussed, eventually we passed it over as it didn't particularly need one as data isn't that reactive and reviews are actually approved before going live, so this isn't an issue either."
    },
    {
      "type": "content",
      "body": "## What would I do differently\n\nMore user research before launch would have been ideal, it would have caught a few issues with the sign up process being a bit long and sometimes confusing depending on options selected."
    }
  ]
}
